list_a = [7, 6, 8, 2, 3, 9, -1, 20]


def search_avg(list_of_elements=[1, 2, 3, 4, 5]):
    """
    Шукаємо середнє арифметичне
    :param list_of_elements: список (за замовчуванням дорівнює [1, 2, 3, 4, 5])
    :return: середнє арифметичне
    """
    avg = sum(list_of_elements)/len(list_of_elements)
    return avg


# Пошук в списку переданому функії напряму
print(f"Середнє арифметичне списку [1, 2] - {search_avg([1, 2])}")

# Пошук в списку переданому функції як змінна
print(f"Середнє арифметичне списку [7, 6, 8, 2, 3, 9, -1, 20] - {search_avg(list_a)}")

# Пошук в списку за замовчуванням
print(f"Середнє арифметичне списку [1, 2, 3, 4, 5] - {search_avg()}")
